# Оригінальний текст
text = """Реве та стогне Дніпр широкий, Сердитий вітер завива. Додолу верби гне високі, 
Горами хвилю підійма. І блідний місяць на ту пору Із хмари де-де виглядав, Неначе човен 
в синім морі, То виринав, то потопав. Ще треті півні не співали, Ніхто ніде не гомонів, 
Сичі в гаю перекликались, Та ясен раз у раз скрипів."""

# Перетворення тексту у нижній регістр
lower_text = text.lower()
print("Текст у нижньому регістрі:")
print(lower_text)

# Замінення коми на пробіл
replace_symbol = text.replace(",", " ")
print("\nТекст без ком:")
print(replace_symbol)

# Кількість слів у тексті
word_count = len(text.split())
print("\nКількість слів у тексті:", word_count)

# Частина 2 - Коваль А.М.
# Підрахунок кількості речень
sentence_count = text.count('.')  # Кількість крапок
print("\nКількість речень у тексті:", sentence_count)

# Видалення голосних літер
vowels = "аеєиіїоуюяАЕЄИІЇОУЮЯ"
no_vowels_text = ''.join([char for char in text if char not in vowels])
print("\nТекст без голосних літер:")
print(no_vowels_text)

# Переставлення слів у зворотному порядку
reversed_words_text = ' '.join(text.split()[::-1])
print("\nТекст із переставленими словами:")
print(reversed_words_text)
